Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When the `--parameters` compiler argument is enabled, Quarkus REST may infer the parameter names from the method argument names, making the `@PathParam("id")` annotation optional in this case.
ja_jp: `--parameters` コンパイラ引数が有効な場合、Quarkus REST はメソッドの引数名からパラメータ名を推測することができるため、この場合 `@PathParam("id")` アノテーションはオプションになります。

source: When the `--parameters` compiler argument is enabled, RESTEasy Reactive may infer the parameter names from the method argument names, making the `@PathParam("id")` annotation optional in this case.
ja_jp: `--parameters` コンパイラ引数が有効な場合、RESTEasy Reactive はメソッドの引数名からパラメータ名を推測することができるため、この場合は `@PathParam("id")` アノテーションを省略できます。

source: When the `failure-strategy` is set to `dead-letter-queue` indicates on which topic the record is sent. Defaults is `dead-letter-topic-$channel` Type: _string_
ja_jp: `failure-strategy` に `dead-letter-queue` が設定されている場合、どのトピックにレコードが送信されるかを示します。デフォルトは `dead-letter-topic-$channel` Type: _string_

source: When the `failure-strategy` is set to `dead-letter-queue` indicates the key serializer to use. If not set the serializer associated to the key deserializer is used Type: _string_
ja_jp: `failure-strategy` に `dead-letter-queue` が設定されている場合、 使用するキーシリアライザを示します。設定されていない場合は、キーデシリアライザに関連付けられたシリアライザが使用されます。 Type: _string_

source: When the `failure-strategy` is set to `dead-letter-queue` indicates the value serializer to use. If not set the serializer associated to the value deserializer is used Type: _string_
ja_jp: `failure-strategy` に `dead-letter-queue` が設定されている場合、使用する値のシリアライザを示します。設定されていない場合は、値のデシリアライザに関連付けられたシリアライザが使用されます。 Type: _string_

source: When the `protoc` command line exceeds the maximum command length, you can ask Quarkus to use an argument file to pass the arguments to the `protoc` command.
ja_jp: `protoc` コマンドラインが最大コマンド長を超える場合、引数ファイルを使用して引数を `protoc` コマンドに渡すように Quarkus に要求できます。

source: When the `quarkus-rest-client-jackson` extension is installed, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations.
ja_jp: `quarkus-rest-client-jackson` エクステンションがインストールされている場合、メディア型が `@Produces` または `@Consumes` アノテーションによって明示的に設定されていない限り、Quarkus はほとんどの返り値に対してデフォルトで `application/json` メディア型を使用します。

source: When the `quarkus-rest-client-reactive-jackson` extension is installed, Quarkus will use the `application/json` media type by default for most return values, unless the media type is explicitly set via `@Produces` or `@Consumes` annotations.
ja_jp: `quarkus-rest-client-reactive-jackson` エクステンションがインストールされている場合、メディアタイプが `@Produces` または `@Consumes` アノテーションによって明示的に設定されていない限り、Quarkus はデフォルトでほとんどの戻り値に `application/json` メディアタイプを使用します。

source: When the `quarkus-rest-csrf` extension is used together with the `quarkus-security` extension, the `io.quarkus.vertx.http.security.HttpSecurity` CDI event allows you to customize the CSRF prevention programmatically:
ja_jp: `quarkus-rest-csrf` エクステンションが `quarkus-security` エクステンションと組み合わせて使用される場合、`io.quarkus.vertx.http.security.HttpSecurity` CDI イベントにより、CSRF 防止機能をプログラムでカスタマイズできます。

source: When the `quarkus.oidc.authentication.user-info-required` property is set to `true` to require that an access token is used to request `UserInfo`, you must add a `scope=openid` query parameter to the token grant request command, for example:
ja_jp: `quarkus.oidc.authentication.user-info-required` プロパティーが `true` に設定され、`UserInfo` をリクエストするためにアクセストークンの使用が要求される場合、トークン付与リクエストコマンドに `scope=openid` クエリーパラメーターを追加する必要があります。次に例を示します。

source: When the `rectify` option is enabled, `quarkus:update`, instead of suggesting the latest recommended Quarkus version updates, will log update instructions to simply align the extension dependency versions found in the project with the currently imported Quarkus platform BOMs.
ja_jp: `rectify` オプションが有効な場合、 `quarkus:update` は、最新の推奨される Quarkus バージョンの更新を提案する代わりに、プロジェクトで見つかったエクステンションの依存関係バージョンを現在インポートされている Quarkus プラットフォームの BOM に合わせるための更新手順をログに記録します。

source: When the `singletons/enum` endpoint is queried, it will always return the same value, even after the application is restarted:
ja_jp: `singletons/enum` エンドポイントがクエリーされると、アプリケーションが再起動された後でも、常に同じ値が返されます。

source: When the `singletons/static` endpoint is queried, it will always return the same value, even after the application is restarted:
ja_jp: `singletons/static` のエンドポイントに問い合わせると、アプリケーションを再起動しても常に同じ値が返されます。

source: When the `url` parameter is non-null, it will override the base URL that is configured for the client (the default base URL configuration is still mandatory).
ja_jp: `url` パラメーターが null 以外の場合、クライアントに設定されているベース URL がオーバーライドされます (デフォルトのベース URL 設定は引き続き必須です)。

source: When the application is tested using `@QuarkusIntegrationTest` it is launched using the `prod` configuration profile, but this can be changed using the `quarkus.test.integration-test-profile` property.
ja_jp: `@QuarkusIntegrationTest` を使ってアプリケーションをテストすると、 `prod` の設定プロファイルを使って起動しますが、これは `quarkus.test.integration-test-profile` プロパティを使って変更することができます。

source: When the application starts and the `stork-service-registration-consul` dependency, besides the `quarkus-smallrye-stork`, is present:
ja_jp: アプリケーションが起動し、`quarkus-smallrye-stork` に加えて `stork-service-registration-consul` 依存関係が存在する場合、以下の処理が行われます。

source: When the application starts in development or test mode, Compose Dev Services decides whether to start services or to discover already running services based on the configuration. When the application stops, Compose Dev Services stops the services it started.
ja_jp: アプリケーションが開発モードまたはテストモードで起動すると、Compose Dev Services は設定に基づいてサービスを起動するか、すでに実行中のサービスを検出するかを決定します。アプリケーションが停止すると、Compose Dev Services は起動したサービスを停止します。

source: When the application starts, it connects to Consul using the Vert.x Consul Client and registers our two instances. Both registration uses the same name (`my-service`), but different ids to indicate that it's two instances of the same _service_.
ja_jp: アプリケーションが起動すると、Vert.x Consul Clientを使ってConsulに接続し、2つのインスタンスを登録します。どちらの登録も同じ名前( `my-service` )を使用していますが、同じ _サービス_ の2つのインスタンスであることを示すために異なるIDを使用しています。

source: When the authorization code flow fails, the user gets HTTP 401 status error by default, but a better user experience can be provided by returning a formatted page explaining to the user what happened. You can use `quarkus.oidc.authentication.error-path` to point to the endpoint resource which can access the `error` and `error_description` parameters forwarded to it by Quarkus OIDC to create such a page.
ja_jp: 認可コードフローが失敗した場合、ユーザーはデフォルトで HTTP 401 ステータスエラーを受け取りますが、何が起こったのかをユーザーに説明する整形されたページを返すことで、より良いユーザー体験を提供できます。 `quarkus.oidc.authentication.error-path` を使用して、Quarkus OIDC から転送された `error` および `error_description` パラメーターにアクセスしてそのようなページを作成できるエンドポイントリソースを指定できます。

source: When the authorization code flow is completed, Quarkus gets access to the `ID token` which can provide sufficient information about the currently authenticated user. However, quite often, an additional remote request to the OIDC provider's https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] endpoint is required to get more details about the user.
ja_jp: 認可コードフローが完了すると、Quarkus は現在認証されているユーザーに関する十分な情報を提供できる `ID トークン` にアクセスできるようになります。しかし、ユーザーの詳細情報を取得するために、OIDC プロバイダーの https://openid.net/specs/openid-connect-core-1_0.html#UserInfo[UserInfo] エンドポイントへの追加のリモートリクエストが必要になることがよくあります。

source: When the base image has not been changed (and therefore `ubi8/openjdk-11-runtime` or `ubi8/openjdk-17-runtime` is used), then the `quarkus.jib.jvm-arguments` configuration property can be used in order to make the JVM listen on the debug port at startup.
ja_jp: ベースイメージが変更されていない（つまり、 `ubi8/openjdk-11-runtime` または `ubi8/openjdk-17-runtime` が使用されている）場合、 `quarkus.jib.jvm-arguments` 設定プロパティを使用して、起動時に JVM がデバッグポートをリッスンするようにすることができます。

source: When the base image has not been changed (and therefore `ubi8/openjdk-11-runtime`, `ubi8/openjdk-17-runtime`, or `ubi8/openjdk-21-runtime` is used), then the `quarkus.jib.jvm-additional-arguments` configuration property can be used in order to make the JVM listen on the debug port at startup.
ja_jp: ベース・イメージが変更されていない場合（したがって `ubi8/openjdk-11-runtime` 、 `ubi8/openjdk-17-runtime` 、または `ubi8/openjdk-21-runtime` が使用されている場合）、起動時にJVMをデバッグ・ポートでリッスンさせるために、 `quarkus.jib.jvm-additional-arguments` 設定プロパティを使用できます。

source: When the base image has not been changed (and therefore `ubi9/openjdk-17-runtime`, or `ubi9/openjdk-21-runtime` is used), then the `quarkus.jib.jvm-additional-arguments` configuration property can be used in order to make the JVM listen on the debug port at startup.
ja_jp: ベース・イメージが変更されていない場合（したがって `ubi9/openjdk-17-runtime` 、または `ubi9/openjdk-21-runtime` ）、起動時にJVMにデバッグ・ポートをリッスンさせるために、 `quarkus.jib.jvm-additional-arguments` 設定プロパティを使用できます。

source: When the build completes, the output will contain (among other things) the following:
ja_jp: ビルドが完了すると、出力には（他にも多数ありますが特に）次のようなものが含まれます。

source: When the call to the remote throws an exception, the cache does not store the result, so that a subsequent call to `callRemote()` with the same parameter value will not be answered out of the cache. It will instead result in another attempt to call the remote.
ja_jp: リモートへの呼び出しが例外をスローした場合、キャッシュは結果を保存しないので、 同じパラメーター値を持つ `callRemote()` への後続の呼び出しがキャッシュから応答されることはありません。その代わりに、リモートへの呼び出しを再度試みることになります。

source: When the claims contain sensitive information, their confidentiality can be ensured by using the link:https://tools.ietf.org/html/rfc7516[JSON Web Encryption (JWE)] specification. This approach produces a JWT with encrypted claims.
ja_jp: クレームに機密情報が含まれる場合、link:https://tools.ietf.org/html/rfc7516[JSON Web Encryption (JWE)] 仕様を使用することで、その機密性を確保できます。 この方法では、クレームが暗号化された JWT が生成されます。

source: When the code invokes the rest client, the virtual thread is blocked, BUT the carrier thread is not blocked (that's the virtual thread _magic touch_).
ja_jp: コードがRESTクライアントを呼び出すと、仮想スレッドはブロックされますが、キャリア・スレッドはブロックされません（これが仮想スレッドの _マジック・タッチ_ です）。

source: When the configuration is not enough
ja_jp: 設定だけでは不十分な場合

source: When the configuration of Elasticsearch Dev Services changes, Quarkus will always restart the corresponding containers.
ja_jp: Elasticsearch Dev Services の設定が変更されると、 Quarkus は必ず対応するコンテナーを再起動します。

source: When the configuration of any database Dev Services changes, Quarkus will always restart all database Dev Services.
ja_jp: データベースDev Servicesの設定が変更されると、Quarkusは常にすべてのデータベースDev Servicesを再起動します。

source: When the connection pool is depleted, attempts to obtain a connection are put into a queue. By default, maximum number of attempts waiting in the queue to obtain a Redis connection is 24. This can be configured using `quarkus.redis.max-pool-waiting`.
ja_jp: 接続プールから接続がなくなると、接続を取得する試行はキューに入れられます。 デフォルトでは、キューで待機している間に Redis 接続取得を試行する回数は最大で 24 回です。 これは `quarkus.redis.max-pool-waiting` を使用して設定できます。

source: When the connector receives a Cloud Event, it attaches an `IncomingKafkaCloudEventMetadata` to the message metadata. So, you can retrieve the various attributes as well as the extensions:
ja_jp: コネクタはクラウドイベントを受信すると、メッセージのメタデータに `IncomingKafkaCloudEventMetadata` をアタッチします。そのため、拡張だけでなく様々な属性を取得することができます。

source: When the container starts, Quarkus will copy a file at the specified path containing environment variable-style port mappings:
ja_jp: コンテナーが起動すると、Quarkus は指定されたパスに環境変数形式のポートマッピングを含むファイルをコピーします:

source: When the current authenticated user returns to the protected Quarkus endpoint and the ID token associated with the session cookie has expired, the user is automatically redirected to the OIDC authorization endpoint to re-authenticate by default. The OIDC provider might challenge the user again if the user session with this provider is still active, which can happen if the session is configured to last longer than the ID token.
ja_jp: 現在認証されているユーザーが保護された Quarkus エンドポイントに戻り、セッション Cookie に関連付けられた ID トークンが期限切れになると、デフォルトでは、ユーザーは再認証のために OIDC 認可エンドポイントに自動的にリダイレクトされます。 ユーザーとこのプロバイダー間のセッションがまだアクティブな場合、OIDC プロバイダーはユーザーに再度チャレンジする可能性があります。これは、セッションが ID トークンよりも長く続くように設定されている場合に発生する可能性があります。

source: When the current authenticated user returns to the protected Quarkus endpoint and the ID token associated with the session cookie has expired, then, by default, the user is automatically redirected to the OIDC Authorization endpoint to re-authenticate. The OIDC provider might challenge the user again if the session between the user and this OIDC provider is still active, which might happen if the session is configured to last longer than the ID token.
ja_jp: 現在認証されているユーザーが、保護された Quarkus エンドポイントに戻り、セッションクッキーに関連付けられた ID トークンの有効期限が切れると、デフォルトでは、ユーザーは再認証のために OIDC 認可エンドポイントに自動的にリダイレクトされます。 ユーザーとこの OIDC プロバイダー間のセッションがまだアクティブな場合、OIDC プロバイダーはユーザーに再度チャレンジする可能性があります。これは、セッションが ID トークンよりも長く続くように設定されている場合に発生する可能性があります。

source: When the currently authenticated user returns to the protected Quarkus endpoint and the ID token associated with the session cookie has expired then, by default, the user will be auto-redirected to the OIDC Authorization endpoint to re-authenticate. Most likely the OIDC provider will challenge the user again though not necessarily if the session between the user and this OIDC provider is still active which may happen if it is configured to last longer than the ID token.
ja_jp: 現在認証されているユーザーが保護された Quarkus エンドポイントに戻り、セッションクッキーに関連付けられた ID トークンの有効期限が切れた場合、デフォルトでは、再認証のために OIDC 認証エンドポイントに自動でリダイレクトされます。OIDC プロバイダーは、ユーザーとこの OIDC プロバイダーとのセッションがまだ有効であれば、必ずしも再チャレンジする必要はありませんが、ID トークンよりも長くセッションが持続するように設定されている場合は、そのようになる可能性があります。

source: When the deployment is done, the output will display the URL to access your application.
ja_jp: デプロイが完了すると、出力にはアプリケーションにアクセスするためのURLが表示されます。

source: When the extension is present, Micrometer is enabled by default as are OpenTelemetry tracing, metrics and logs.
ja_jp: エクステンションが存在する場合、Micrometer は、OpenTelemetry トレース、メトリクス、ログと同様にデフォルトで有効になります。

source: When the file is opened, we retrieve a `Multi` which will contain the chunks.
ja_jp: ファイルが開かれると、チャンクを含む `Multi` が取得できます。

source: When the filter is enabled and identifies an HTTP request as cross-origin, it will enforce the CORS policy. It will also add headers configured with the following properties before forwarding the request to its intended destination, like a servlet, Jakarta REST resource, or other endpoints.
ja_jp: フィルタが有効で、HTTPリクエストがクロスオリジンであると識別されると、CORSポリシーが適用されます。 また、サーブレット、Jakarta REST リソース、または他のエンドポイントのような意図された宛先にリクエストを転送する前に、以下のプロパティで構成されたヘッダを追加します。

source: When the first request has been submitted, the Jaeger tracer within the app will be initialized:
ja_jp: 最初のリクエストが送信されると、アプリ内のJaegerトレーサーが初期化されます:

source: When the first request has been submitted, you will be able to see the tracing information in the logs:
ja_jp: 最初のリクエストが送信された時点で、ログにトレース情報が表示されるようになります:

source: When the incoming bearer access token is in binary format or when you login users with OAuth2 providers which give Quarkus only a binary access token, with no remote introspection endpoint available in both cases, how to verify this binary token ?
ja_jp: 入ってくるベアラーアクセストークンがバイナリ形式である場合や、リモートイントロスペクションエンドポイントが利用できない OAuth2 プロバイダーでユーザーをログインさせ、Quarkus がバイナリのアクセストークンしか受け取らない場合、このバイナリトークンをどのように検証すればよいでしょうか。

source: When the incoming request matches a valid certificate in the truststore, your application can obtain the subject by injecting a `SecurityIdentity` as follows:
ja_jp: 受信リクエストがトラストストア内の有効な証明書と一致する場合、アプリケーションは次のように `SecurityIdentity` を注入してサブジェクトを取得できます。

source: When the method returns `void`, and so does not return a `Multi`, the code must subscribe to the incoming `Multi`. Otherwise, no data will be consumed, and the connection will not be closed:
ja_jp: メソッドが `void` を返し、 `Multi` を返さない場合、コードは受信する `Multi` をサブスクライブする必要があります。 そうしないと、データが消費されず、接続が閉じられません。

source: When the name of the container does not match the application name (or the overridden name), container specific configuration will be ignored.
ja_jp: コンテナー名がアプリケーション名 (またはオーバーライドされた名前) と一致しない場合、コンテナー固有の設定は無視されます。

source: When the operation completes, we will get a `RowSet` that has all the rows buffered in memory. A `RowSet` is an `java.lang.Iterable<Row>` and thus can be converted to a `Multi`:
ja_jp: 操作が完了すると、すべての行がメモリーにバッファーリングされた `RowSet` を取得します。 `RowSet` は `java.lang.Iterable<Row>` です。したがって、 `Multi` に変換できます。

source: When the provider is used during an HTTP request, the tenant configuration can be resolved as described in the xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] guide. However, when there is no active HTTP request, you must select the tenant explicitly with the `io.quarkus.oidc.TenantFeature` qualifier.
ja_jp: HTTP リクエスト中にプロバイダーが使用される場合、テナント設定を解決できます。 xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシーの使用] ガイドの説明を参照してください。 ただし、アクティブな HTTP リクエストがない場合は、 `io.quarkus.oidc.TenantFeature` 修飾子を使用してテナントを明示的に選択する必要があります。

source: When the provider is used during an HTTP request, the tenant configuration can be resolved as described in the xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] guide. However, when there is no active HTTP request, you must select the tenant explicitly with the `io.quarkus.oidc.Tenant` qualifier.
ja_jp: HTTP リクエスト中にプロバイダーが使用される場合、テナント設定を解決できます。 xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナンシーの使用] ガイドの説明を参照してください。 ただし、アクティブな HTTP リクエストがない場合は、 `io.quarkus.oidc.Tenant` 修飾子を使用してテナントを明示的に選択する必要があります。

source: When the resource name does not match the application name (or the overridden name) rather than reusing the resource a new one will be added. Same goes for the container.
ja_jp: リソース名がアプリケーション名 (またはオーバーライドされた名前) と一致しない場合、リソースを再利用するのではなく、新しいものが追加されます。これは、コンテナーについても当てはまります。

source: When the response is received, we extract the body and return it as the HTTP response
ja_jp: レスポンスを受信したら、ボディを抽出してHTTPレスポンスとして返します。

source: When the result of the `userPublic` method is serialized, the `id` field will not be contained in the response as the `Public` view does not include it. The result of `userPrivate` however will include the `id` as expected when serialized.
ja_jp: `userPublic` メソッドの結果がシリアライズされるとき、 `Public` ビューには `id` フィールドが含まれていないため、レスポンスには フィールドは含まれません。 しかし、 `userPrivate` の結果は、シリアライズされたときに期待されるように `id` を含みます。

source: When the result the `userPublic` method is serialized, the `id` field will not be contained in the response as the `Public` view does not include it. The result of `userPrivate` however will include the `id` as expected when serialized.
ja_jp: 結果の `userPublic` メソッドがシリアル化されると、 `Public` ビューに含まれないため、 `id` フィールドはレスポンスに含まれません。ただし、 `userPrivate` の結果には、シリアル化されたときに期待されるように `id` が含まれます。

source: When the serialization and deserialization must use a different codec, you can specify the codec to use for the serialization and deserialization separately:
ja_jp: シリアライゼーションとデシリアライゼーションで異なるコーデックを使用する必要がある場合は、シリアライゼーションとデシリアライゼーションに使用するコーデックを個別に指定できます。

source: When the session can not be refreshed, the currently authenticated user is redirected to the OIDC provider to re-authenticate. However, the user experience may not be ideal in such cases if the user, after a previous successful authentication, suddenly sees an OIDC authentication challenge screen when trying to access an application page.
ja_jp: セッションを更新できない場合、現在認証されているユーザーは再認証のために OIDC プロバイダーにリダイレクトされます。 ただし、ユーザーが以前に認証に成功した後、アプリケーションページにアクセスしようとしたときに突然 OIDC 認証チャレンジ画面が表示されるのは、ユーザーエクスペリエンスとして最適ではない可能性があります。

source: When the session can not be refreshed, the currently authenticated user is redirected to the OIDC provider to re-authenticate. However, the user experience may not be ideal in such cases, if the user, after an earlier successful authentication, is suddently seeing an OIDC authentication challenge screen when trying to access an application page.
ja_jp: セッションを更新できない場合、現在認証されているユーザーが OIDC プロバイダーにリダイレクトされ、再認証が行われます。ただし、ユーザーが以前に認証に成功した後、アプリケーションページにアクセスしようとしたときに突然 OIDC 認証チャレンジ画面が表示されるのは、ユーザーエクスペリエンスとして最適ではない可能性があります。

source: When the test stops, clear the `InMemoryConnector` (discard all the received and sent messages)
ja_jp: テストが停止したら、`InMemoryConnector` をクリアします (受信したメッセージと送信したメッセージをすべて破棄してください)。

source: When the tokens must be introspected, some providers may require the introspection specific authentication credentials, as opposed to the already configured OIDC client id and one of the OIDC client authentication credentials:
ja_jp: トークンをイントロスペクションする必要がある場合、一部のプロバイダーは、既に設定されている OIDC クライアント ID や OIDC クライアント認証クレデンシャルとは別に、イントロスペクション固有の認証クレデンシャルを要求することがあります。

source: When the user is redirected back to Quarkus to complete the authorization code flow, Quarkus expects the request URI to include the `state` query parameter that matches the current state cookie value.
ja_jp: ユーザーが認可コードフローを完了するために Quarkus にリダイレクトされると、Quarkus はリクエスト URI に `state` クエリーパラメーターが含まれており、それが現在の状態 Cookie の値と一致していると想定します。

source: When the user is redirected to the OIDC authorization endpoint to authenticate and, if necessary, authorize the Quarkus application, this redirect request might fail, for example, when an invalid scope is included in the redirect URI. In such cases, the provider redirects the user back to Quarkus with `error` and `error_description` parameters instead of the expected `code` parameter.
ja_jp: ユーザーが OIDC 認可エンドポイントにリダイレクトされ、Quarkus アプリケーションを認証し、必要に応じて認可する場合、このリダイレクトリクエストは、リダイレクト URI に無効なスコープが含まれている場合などに失敗する可能性があります。 このような場合、プロバイダーは、想定される `code` パラメーターではなく、 `error` および `error_description` パラメーターを使用してユーザーを Quarkus にリダイレクトします。

source: When the user is redirected to the OpenID Connect Provider to authenticate, the redirect URL includes a `redirect_uri` query parameter which indicates to the Provider where the user has to be redirected to once the authentication has been completed.
ja_jp: ユーザーが認証のために OpenID Connect プロバイダーにリダイレクトされる場合、リダイレクト URL には、認証が完了した後にユーザーをリダイレクトする必要がある場所をプロバイダーに示す `redirect_uri` クエリーパラメーターが含まれます。

source: When the user presses `@`, the Dev Assistant is invoked and responds in the log:
ja_jp: ユーザーが `@` を押すと、 Dev Assistant が呼び出され、ログ内で応答します。

source: When these 2 configurations are set in the `application.properties` file:
ja_jp: `application.properties` ファイルで次の 2 つの設定が指定されている場合:

source: When these properties are used, the generated manifests will contain everything required. The application config volumes will be created using path: `/mnt/app-secret` and `/mnt/app-config-map` for secrets and configmaps respectively.
ja_jp: これらのプロパティーを使用すると、生成されたマニフェストには必要なものがすべて含まれます。アプリケーションのコンフィグボリュームは、Secret と ConfigMap にそれぞれパスを使用して作成されます。Secret と ConfigMap はそれぞれ `/mnt/app-secret` と `/mnt/app-config-map` を使用して作成されます。

source: When things got a little hairy (SMBJ was trickier than we thought), we got some help from the https://medium.com/GraalVM/introducingthe-tracing-agent-simplifying-GraalVM-native-image-configuration-c3b56c486271[GraalVM tracing agent].
ja_jp: ちょっとした問題が発生したとき（SMBJは思ったよりも厄介だった）、 link:https://medium.com/GraalVM/introducingthe-tracing-agent-simplifying-GraalVM-native-image-configuration-c3b56c486271[GraalVMのトレースエージェント]から助けを得ました。

source: When this build step is run nothing is printed to the console. This is because the `HelloRecorder` that is injected is actually a proxy that records all invocations. Instead if we run the resulting Quarkus program we will see 'Hello World' printed to the console.
ja_jp: このビルドステップを実行しても、コンソールには何も表示されません。これは、注入された `HelloRecorder` が、実際にはすべての呼び出しを記録するプロキシであるためです。代わりに、生成されたQuarkusプログラムを実行すると、コンソールに「Hello World」が出力されます。
